docs: refine Setorin README
